---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewCameraOrientation
source: html/c461e0fd-0215-4dff-2752-188ef0e43cc5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewCameraOrientation Property

"Locked Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewCameraOrientation { get; }
```